RT-Thread-Studio/sdk-csp-gd32h7/libraries/GD32H75E_standard_peripheral/Include/gd32h75e_exmc.h
/* EXMC NOR/SRAM write mode */
#define EXMC_ASYN_WRITE                     ((uint32_t)0x00000000U)                                       /*!< asynchronous write mode */
#define EXMC_SYN_WRITE                      EXMC_SNCTL_SYNCWR                                             /*!< synchronous write mode */

/* EXMC NWAIT signal configuration */
#define EXMC_NWAIT_CONFIG_BEFORE            ((uint32_t)0x00000000U)                                       /*!< NWAIT signal is active one data cycle before wait state */
#define EXMC_NWAIT_CONFIG_DURING            EXMC_SNCTL_NRWTCFG                                            /*!< NWAIT signal is active during wait state */

/* EXMC NWAIT signal polarity configuration */
#define EXMC_NWAIT_POLARITY_LOW             ((uint32_t)0x00000000U)                                       /*!< low level is active of NWAIT */
#define EXMC_NWAIT_POLARITY_HIGH            EXMC_SNCTL_NRWTPOL                                            /*!< high level is active of NWAIT */

/* EXMC NAND bank definition */
#define EXMC_BANK2_NAND                     ((uint32_t)0x00000002U)                                       /*!< NAND flash bank2 */

/* EXMC SDRAM bank definition */
#define EXMC_SDRAM_DEVICE0                  ((uint32_t)0x00000004U)                                       /*!< SDRAM device0 */
#define EXMC_SDRAM_DEVICE1                  ((uint32_t)0x00000005U)                                       /*!< SDRAM device1 */

/* EXMC SDRAM internal banks */
#define EXMC_SDRAM_2_INTER_BANK             ((uint32_t)0x00000000U)                                       /*!< 2 internal banks */
#define EXMC_SDRAM_4_INTER_BANK             EXMC_SDCTL_NBK                                                /*!< 4 internal banks */

/* SDRAM device0 select */
#define EXMC_SDRAM_DEVICE0_UNSELECT         ((uint32_t)0x00000000U)                                       /*!< SDRAM device0 unselect */
#define EXMC_SDRAM_DEVICE0_SELECT           EXMC_SDCMD_DS0                                                /*!< SDRAM device0 select */

/* SDRAM device1 select */
#define EXMC_SDRAM_DEVICE1_UNSELECT         ((uint32_t)0x00000000U)                                       /*!< SDRAM device1 unselect */
#define EXMC_SDRAM_DEVICE1_SELECT           EXMC_SDCMD_DS1                                                /*!< SDRAM device1 select */

/* SDRAM device status */
#define EXMC_SDRAM_DEVICE_NORMAL            ((uint32_t)0x00000000U)                                       /*!< normal status */
#define EXMC_SDRAM_DEVICE_SELF_REFRESH      ((uint32_t)0x00000001U)                                       /*!< self refresh status */
#define EXMC_SDRAM_DEVICE_POWER_DOWN        ((uint32_t)0x00000002U)                                       /*!< power down status */

/* sample cycle of read data */
#define EXMC_SDRAM_READSAMPLE_0_EXTRACK     ((uint32_t)0x00000000U)                                       /*!< add 0 extra CK_EXMC cycle to the read data sample clock besides the delay chain */
#define EXMC_SDRAM_READSAMPLE_1_EXTRACK     EXMC_SDRSCTL_SSCR                                             /*!< add 1 extra CK_EXMC cycle to the read data sample clock besides the delay chain */

/* EXMC flag bits */
#define EXMC_NAND_FLAG_RISE                 EXMC_NINTEN_INTRS                                             /*!< rising edge interrupt status */
#define EXMC_NAND_FLAG_LEVEL                EXMC_NINTEN_INTHS                                             /*!< high-level interrupt status */
#define EXMC_NAND_FLAG_FALL                 EXMC_NINTEN_INTFS                                             /*!< falling edge interrupt status */
#define EXMC_NAND_FLAG_FIFOE                EXMC_NINTEN_FFEPT                                             /*!< FIFO empty flag */
#define EXMC_SDRAM_FLAG_REFRESH             EXMC_SDSDAT_REIF                                              /*!< refresh error interrupt flag */
#define EXMC_SDRAM_FLAG_NREADY              EXMC_SDSDAT_NRDY                                              /*!< not ready status */

/* EXMC interrupt bits */
#define EXMC_NAND_INT_RISE                  EXMC_NINTEN_INTREN                                            /*!< rising edge interrupt */
#define EXMC_NAND_INT_LEVEL                 EXMC_NINTEN_INTHEN                                            /*!< high-level interrupt */
#define EXMC_NAND_INT_FALL                  EXMC_NINTEN_INTFEN                                            /*!< falling edge interrupt */
#define EXMC_SDRAM_INT_REFRESH              EXMC_SDARI_REIE                                               /*!< refresh error interrupt */

/* EXMC interrupt flag bits */
#define EXMC_NAND_INT_FLAG_RISE             EXMC_NINTEN_INTREN                                            /*!< rising edge interrupt flag */
#define EXMC_NAND_INT_FLAG_LEVEL            EXMC_NINTEN_INTHEN                                            /*!< high-level interrupt flag */
#define EXMC_NAND_INT_FLAG_FALL             EXMC_NINTEN_INTFEN                                            /*!< falling edge interrupt flag */
#define EXMC_SDRAM_INT_FLAG_REFRESH         EXMC_SDARI_REIE                                               /*!< refresh error interrupt flag */

/* parameter check definitions */
#ifdef FW_DEBUG_ERR_REPORT
#define NOT_EXMC_BANK0_NORSRAM_REGION(xxx)    (((xxx) != EXMC_BANK0_NORSRAM_REGION0) && ((xxx) != EXMC_BANK0_NORSRAM_REGION1) && \
                                              ((xxx) != EXMC_BANK0_NORSRAM_REGION2) && ((xxx) != EXMC_BANK0_NORSRAM_REGION3))

#define NOT_EXMC_ASYN_SYN_WRITE(xxx)          (((xxx) != EXMC_ASYN_WRITE) && ((xxx) != EXMC_SYN_WRITE))

#define NOT_EXMC_ENABLE_DISABLE(xxx)          (((xxx) != ENABLE)  && ((xxx) != DISABLE))

#define NOT_EXMC_NWAIT_CONFIG(xxx)            (((xxx) != EXMC_NWAIT_CONFIG_BEFORE) && ((xxx) != EXMC_NWAIT_CONFIG_DURING))

#define NOT_EXMC_NWAIT_POLARITY(xxx)          (((xxx) != EXMC_NWAIT_POLARITY_LOW)  && ((xxx) != EXMC_NWAIT_POLARITY_HIGH))

#define NOT_EXMC_NOR_DATABUS_WIDTH(xxx)       (((xxx) != EXMC_NOR_DATABUS_WIDTH_8B)  && ((xxx) != EXMC_NOR_DATABUS_WIDTH_16B))

