RT-Thread-Studio/sdk-csp-gd32h7/libraries/GD32H75E_standard_peripheral/Include/gd32h75e_exmc.h
#define NOT_EXMC_MEMORY_TYPE(xxx)             (((xxx) != EXMC_MEMORY_TYPE_SRAM)  && ((xxx) != EXMC_MEMORY_TYPE_PSRAM) && \
                                              ((xxx) != EXMC_MEMORY_TYPE_NOR))

#define NOT_EXMC_CRAM_PAGE_SIZE(xxx)          (((xxx) != EXMC_CRAM_AUTO_SPLIT)           && ((xxx) != EXMC_CRAM_PAGE_SIZE_128_BYTES) && \
                                              ((xxx) != EXMC_CRAM_PAGE_SIZE_256_BYTES)  && ((xxx) != EXMC_CRAM_PAGE_SIZE_512_BYTES) && \
                                              ((xxx) != EXMC_CRAM_PAGE_SIZE_1024_BYTES))

#define NOT_EXMC_ACCESS_MODE(xxx)             (((xxx) != EXMC_ACCESS_MODE_A) && ((xxx) != EXMC_ACCESS_MODE_B) && \
                                              ((xxx) != EXMC_ACCESS_MODE_C) && ((xxx) != EXMC_ACCESS_MODE_D))

#define NOT_EXMC_DATALAT_CLK(xxx)             (((xxx) != EXMC_DATALAT_2_CLK)  && ((xxx) != EXMC_DATALAT_3_CLK) && \
                                              ((xxx) != EXMC_DATALAT_4_CLK)  && ((xxx) != EXMC_DATALAT_5_CLK) && \
                                              ((xxx) != EXMC_DATALAT_6_CLK)  && ((xxx) != EXMC_DATALAT_7_CLK) && \
                                              ((xxx) != EXMC_DATALAT_8_CLK)  && ((xxx) != EXMC_DATALAT_9_CLK) && \
                                              ((xxx) != EXMC_DATALAT_10_CLK) && ((xxx) != EXMC_DATALAT_11_CLK) && \
                                              ((xxx) != EXMC_DATALAT_12_CLK) && ((xxx) != EXMC_DATALAT_13_CLK) && \
                                              ((xxx) != EXMC_DATALAT_14_CLK) && ((xxx) != EXMC_DATALAT_15_CLK) && \
                                              ((xxx) != EXMC_DATALAT_16_CLK) && ((xxx) != EXMC_DATALAT_17_CLK))

#define NOT_EXMC_SYN_CLOCK_RATIO_CLK(xxx)     (((xxx) != EXMC_SYN_CLOCK_RATIO_DISABLE) && ((xxx) != EXMC_SYN_CLOCK_RATIO_2_CLK) && \
                                              ((xxx) != EXMC_SYN_CLOCK_RATIO_3_CLK)   && ((xxx) != EXMC_SYN_CLOCK_RATIO_4_CLK) && \
                                              ((xxx) != EXMC_SYN_CLOCK_RATIO_5_CLK)   && ((xxx) != EXMC_SYN_CLOCK_RATIO_6_CLK) && \
                                              ((xxx) != EXMC_SYN_CLOCK_RATIO_7_CLK)   && ((xxx) != EXMC_SYN_CLOCK_RATIO_8_CLK) && \
                                              ((xxx) != EXMC_SYN_CLOCK_RATIO_9_CLK)   && ((xxx) != EXMC_SYN_CLOCK_RATIO_10_CLK) && \
                                              ((xxx) != EXMC_SYN_CLOCK_RATIO_11_CLK)  && ((xxx) != EXMC_SYN_CLOCK_RATIO_12_CLK) && \
                                              ((xxx) != EXMC_SYN_CLOCK_RATIO_13_CLK)  && ((xxx) != EXMC_SYN_CLOCK_RATIO_14_CLK) && \
                                              ((xxx) != EXMC_SYN_CLOCK_RATIO_15_CLK)  && ((xxx) != EXMC_SYN_CLOCK_RATIO_16_CLK))

#define NOT_EXMC_NAND_ECC_SIZE(xxx)           (((xxx) != EXMC_ECC_SIZE_256BYTES)  && ((xxx) != EXMC_ECC_SIZE_512BYTES) && \
                                              ((xxx) != EXMC_ECC_SIZE_1024BYTES) && ((xxx) != EXMC_ECC_SIZE_2048BYTES) && \
                                              ((xxx) != EXMC_ECC_SIZE_4096BYTES) && ((xxx) != EXMC_ECC_SIZE_8192BYTES))

#define NOT_EXMC_NAND_ALE_RE_DELAY(xxx)       (((xxx) != EXMC_ALE_RE_DELAY_1_CK_EXMC)  && ((xxx) != EXMC_ALE_RE_DELAY_2_CK_EXMC) && \
                                              ((xxx) != EXMC_ALE_RE_DELAY_3_CK_EXMC)  && ((xxx) != EXMC_ALE_RE_DELAY_4_CK_EXMC) && \
                                              ((xxx) != EXMC_ALE_RE_DELAY_5_CK_EXMC)  && ((xxx) != EXMC_ALE_RE_DELAY_6_CK_EXMC) && \
                                              ((xxx) != EXMC_ALE_RE_DELAY_7_CK_EXMC)  && ((xxx) != EXMC_ALE_RE_DELAY_8_CK_EXMC) && \
                                              ((xxx) != EXMC_ALE_RE_DELAY_9_CK_EXMC)  && ((xxx) != EXMC_ALE_RE_DELAY_10_CK_EXMC) && \
                                              ((xxx) != EXMC_ALE_RE_DELAY_11_CK_EXMC) && ((xxx) != EXMC_ALE_RE_DELAY_12_CK_EXMC) && \
                                              ((xxx) != EXMC_ALE_RE_DELAY_13_CK_EXMC) && ((xxx) != EXMC_ALE_RE_DELAY_14_CK_EXMC) && \
                                              ((xxx) != EXMC_ALE_RE_DELAY_15_CK_EXMC) && ((xxx) != EXMC_ALE_RE_DELAY_16_CK_EXMC))

#define NOT_EXMC_NAND_CLE_RE_DELAY(xxx)       (((xxx) != EXMC_CLE_RE_DELAY_1_CK_EXMC)  && ((xxx) != EXMC_CLE_RE_DELAY_2_CK_EXMC) && \
                                              ((xxx) != EXMC_CLE_RE_DELAY_3_CK_EXMC)  && ((xxx) != EXMC_CLE_RE_DELAY_4_CK_EXMC) && \
                                              ((xxx) != EXMC_CLE_RE_DELAY_5_CK_EXMC)  && ((xxx) != EXMC_CLE_RE_DELAY_6_CK_EXMC) && \
                                              ((xxx) != EXMC_CLE_RE_DELAY_7_CK_EXMC)  && ((xxx) != EXMC_CLE_RE_DELAY_8_CK_EXMC) && \
                                              ((xxx) != EXMC_CLE_RE_DELAY_9_CK_EXMC)  && ((xxx) != EXMC_CLE_RE_DELAY_10_CK_EXMC) && \
                                              ((xxx) != EXMC_CLE_RE_DELAY_11_CK_EXMC) && ((xxx) != EXMC_CLE_RE_DELAY_12_CK_EXMC) && \
                                              ((xxx) != EXMC_CLE_RE_DELAY_13_CK_EXMC) && ((xxx) != EXMC_CLE_RE_DELAY_14_CK_EXMC) && \
                                              ((xxx) != EXMC_CLE_RE_DELAY_15_CK_EXMC) && ((xxx) != EXMC_CLE_RE_DELAY_16_CK_EXMC))

#define NOT_EXMC_NAND_DATABUS_WIDTH(xxx)      (((xxx) != EXMC_NAND_DATABUS_WIDTH_8B)  && ((xxx) != EXMC_NAND_DATABUS_WIDTH_16B))

#define NOT_EXMC_SDRAM_DEVICE(xxx)            (((xxx) != EXMC_SDRAM_DEVICE0) && ((xxx) != EXMC_SDRAM_DEVICE1))

#define NOT_EXMC_SDRAM_PIPELINE_DELAY(xxx)    (((xxx) != EXMC_PIPELINE_DELAY_0_CK_EXMC) && ((xxx) != EXMC_PIPELINE_DELAY_1_CK_EXMC) && \
                                              ((xxx) != EXMC_PIPELINE_DELAY_2_CK_EXMC))

#define NOT_EXMC_SDCLK(xxx)                   (((xxx) != EXMC_SDCLK_DISABLE)           && ((xxx) != EXMC_SDCLK_PERIODS_2_CK_EXMC) && \
                                              ((xxx) != EXMC_SDCLK_PERIODS_3_CK_EXMC) && ((xxx) != EXMC_SDCLK_PERIODS_4_CK_EXMC) && \
                                              ((xxx) != EXMC_SDCLK_PERIODS_5_CK_EXMC))

