RT-Thread-Studio/sdk-csp-gd32h7/libraries/GD32H75E_standard_peripheral/Include/gd32h75e_exmc.h
#define NOT_EXMC_SDRAM_CAS_LATENCY(xxx)       (((xxx) != EXMC_CAS_LATENCY_1_SDCLK) && ((xxx) != EXMC_CAS_LATENCY_2_SDCLK) && \
                                              ((xxx) != EXMC_CAS_LATENCY_3_SDCLK))

#define NOT_EXMC_SDRAM_INTER_BANK(xxx)        (((xxx) != EXMC_SDRAM_2_INTER_BANK) && ((xxx) != EXMC_SDRAM_4_INTER_BANK))

#define NOT_EXMC_SDRAM_DATABUS_WIDTH(xxx)     (((xxx) != EXMC_SDRAM_DATABUS_WIDTH_8B)  && ((xxx) != EXMC_SDRAM_DATABUS_WIDTH_16B) && \
                                              ((xxx) != EXMC_SDRAM_DATABUS_WIDTH_32B))

#define NOT_EXMC_SDRAM_ROW_ADDRESS(xxx)       (((xxx) != EXMC_SDRAM_ROW_ADDRESS_11) && ((xxx) != EXMC_SDRAM_ROW_ADDRESS_12) && \
                                              ((xxx) != EXMC_SDRAM_ROW_ADDRESS_13))

#define NOT_EXMC_SDRAM_COW_ADDRESS(xxx)       (((xxx) != EXMC_SDRAM_COW_ADDRESS_8)  && ((xxx) != EXMC_SDRAM_COW_ADDRESS_9) && \
                                              ((xxx) != EXMC_SDRAM_COW_ADDRESS_10) && ((xxx) != EXMC_SDRAM_COW_ADDRESS_11))

#define NOT_EXMC_BANK_REMAP(xxx)              (((xxx) != EXMC_BANK_REMAP_DEFAULT)       && ((xxx) != EXMC_BANK_NORPSRAM_SDRAM_SWAP))

#define NOT_EXMC_CLOCK_MODE(xxx)              (((xxx) != EXMC_CLOCK_SYN_MODE)        && ((xxx) != EXMC_CLOCK_UNCONDITIONALLY))

#define NOT_EXMC_SDRAM_DELAY_CELL(xxx)        (((xxx) != EXMC_SDRAM_0_DELAY_CELL)  && ((xxx) != EXMC_SDRAM_1_DELAY_CELL) && \
                                              ((xxx) != EXMC_SDRAM_2_DELAY_CELL)  && ((xxx) != EXMC_SDRAM_3_DELAY_CELL) && \
                                              ((xxx) != EXMC_SDRAM_4_DELAY_CELL)  && ((xxx) != EXMC_SDRAM_5_DELAY_CELL) && \
                                              ((xxx) != EXMC_SDRAM_6_DELAY_CELL)  && ((xxx) != EXMC_SDRAM_7_DELAY_CELL) && \
                                              ((xxx) != EXMC_SDRAM_8_DELAY_CELL)  && ((xxx) != EXMC_SDRAM_9_DELAY_CELL) && \
                                              ((xxx) != EXMC_SDRAM_10_DELAY_CELL) && ((xxx) != EXMC_SDRAM_11_DELAY_CELL) && \
                                              ((xxx) != EXMC_SDRAM_12_DELAY_CELL) && ((xxx) != EXMC_SDRAM_13_DELAY_CELL) && \
                                              ((xxx) != EXMC_SDRAM_14_DELAY_CELL) && ((xxx) != EXMC_SDRAM_15_DELAY_CELL))

#define NOT_EXMC_SDRAM_READSAMPLE(xxx)        (((xxx) != EXMC_SDRAM_READSAMPLE_0_EXTRACK) && ((xxx) != EXMC_SDRAM_READSAMPLE_1_EXTRACK))

#define NOT_EXMC_SDRAM_AUTO_REFLESH(xxx)      (((xxx) != EXMC_SDRAM_AUTO_REFLESH_1_SDCLK)  && ((xxx) != EXMC_SDRAM_AUTO_REFLESH_2_SDCLK) && \
                                              ((xxx) != EXMC_SDRAM_AUTO_REFLESH_3_SDCLK)  && ((xxx) != EXMC_SDRAM_AUTO_REFLESH_4_SDCLK) && \
                                              ((xxx) != EXMC_SDRAM_AUTO_REFLESH_5_SDCLK)  && ((xxx) != EXMC_SDRAM_AUTO_REFLESH_6_SDCLK) && \
                                              ((xxx) != EXMC_SDRAM_AUTO_REFLESH_7_SDCLK)  && ((xxx) != EXMC_SDRAM_AUTO_REFLESH_8_SDCLK) && \
                                              ((xxx) != EXMC_SDRAM_AUTO_REFLESH_9_SDCLK)  && ((xxx) != EXMC_SDRAM_AUTO_REFLESH_10_SDCLK) && \
                                              ((xxx) != EXMC_SDRAM_AUTO_REFLESH_11_SDCLK) && ((xxx) != EXMC_SDRAM_AUTO_REFLESH_12_SDCLK) && \
                                              ((xxx) != EXMC_SDRAM_AUTO_REFLESH_13_SDCLK) && ((xxx) != EXMC_SDRAM_AUTO_REFLESH_14_SDCLK) && \
                                              ((xxx) != EXMC_SDRAM_AUTO_REFLESH_15_SDCLK))

#define NOT_EXMC_SDRAM_DEVICE_SELECT(xxx)     (((xxx) != EXMC_SDRAM_DEVICE0_SELECT) && ((xxx) != EXMC_SDRAM_DEVICE1_SELECT))

#define NOT_EXMC_SDRAM_COMMAND(xxx)           (((xxx) != EXMC_SDRAM_NORMAL_OPERATION)   && ((xxx) != EXMC_SDRAM_CLOCK_ENABLE) && \
                                              ((xxx) != EXMC_SDRAM_PRECHARGE_ALL)      && ((xxx) != EXMC_SDRAM_AUTO_REFRESH) && \
                                              ((xxx) != EXMC_SDRAM_LOAD_MODE_REGISTER) && ((xxx) != EXMC_SDRAM_SELF_REFRESH) && \
                                              ((xxx) != EXMC_SDRAM_POWERDOWN_ENTRY))

#define NOT_EXMC_BANK(xxx)                    (((xxx) != EXMC_BANK2_NAND)    && ((xxx) != EXMC_SDRAM_DEVICE0) && \
                                              ((xxx) != EXMC_SDRAM_DEVICE1))

#define NOT_EXMC_NAND_SDRAM_FLAG(xxx)         (((xxx) != EXMC_NAND_FLAG_RISE)     && ((xxx) != EXMC_NAND_FLAG_LEVEL) && \
                                              ((xxx) != EXMC_NAND_FLAG_FALL)     && ((xxx) != EXMC_NAND_FLAG_FIFOE) && \
                                              ((xxx) != EXMC_SDRAM_FLAG_REFRESH) && ((xxx) != EXMC_SDRAM_FLAG_NREADY))

#define NOT_EXMC_NAND_SDRAM_FLAG_CLR(xxx)     (((xxx) != EXMC_NAND_FLAG_RISE)     && ((xxx) != EXMC_NAND_FLAG_LEVEL) && \
                                              ((xxx) != EXMC_NAND_FLAG_FALL)     && ((xxx) != EXMC_NAND_FLAG_FIFOE) && \
                                              ((xxx) != EXMC_SDRAM_FLAG_REFRESH))

#define NOT_EXMC_NAND_SDRAM_INT(xxx)          (((xxx) != EXMC_NAND_INT_RISE)     && ((xxx) != EXMC_NAND_INT_LEVEL) && \
                                              ((xxx) != EXMC_NAND_INT_FALL)     && ((xxx) != EXMC_SDRAM_INT_REFRESH))

#define NOT_EXMC_NAND_SDRAM_INT_FLAG(xxx)     (((xxx) != EXMC_NAND_INT_FLAG_RISE)     && ((xxx) != EXMC_NAND_INT_FLAG_LEVEL) && \
                                              ((xxx) != EXMC_NAND_INT_FLAG_FALL)     && ((xxx) != EXMC_SDRAM_INT_FLAG_REFRESH))

#endif /* FW_DEBUG_ERR_REPORT */


/* function declarations */
/* initialization functions */
/* NOR/SRAM */
/* deinitialize EXMC NOR/SRAM region */
void exmc_norsram_deinit(uint32_t exmc_norsram_region);
/* initialize exmc_norsram_parameter_struct with the default values */
void exmc_norsram_struct_para_init(exmc_norsram_parameter_struct *exmc_norsram_init_struct);
/* initialize EXMC NOR/SRAM region */
void exmc_norsram_init(exmc_norsram_parameter_struct *exmc_norsram_init_struct);
/* enable EXMC NOR/SRAM region */
void exmc_norsram_enable(uint32_t exmc_norsram_region);
/* disable EXMC NOR/SRAM region */
void exmc_norsram_disable(uint32_t exmc_norsram_region);
/* NAND */
/* deinitialize EXMC NAND bank */
void exmc_nand_deinit(void);
/* initialize exmc_nand_parameter_struct with the default values */
void exmc_nand_struct_para_init(exmc_nand_parameter_struct *exmc_nand_init_struct);
/* initialize EXMC NAND bank */
void exmc_nand_init(exmc_nand_parameter_struct *exmc_nand_init_struct);
/* enable EXMC NAND bank */
void exmc_nand_enable(void);
/* disable EXMC NAND bank */
void exmc_nand_disable(void);
/* SDRAM */
/* deinitialize EXMC SDRAM device */
void exmc_sdram_deinit(uint32_t exmc_sdram_device);
/* initialize exmc_sdram_parameter_struct with the default values */
void exmc_sdram_struct_para_init(exmc_sdram_parameter_struct *exmc_sdram_init_struct);
/* initialize EXMC SDRAM device */
void exmc_sdram_init(exmc_sdram_parameter_struct *exmc_sdram_init_struct);

/* configuration functions */
/* NOR/SRAM */
/* configure NOR/PSRAM and SDRAM remap */
void exmc_norsram_sdram_remap_config(uint32_t bank_remap);
/* get NOR/PSRAM and SDRAM remap configuration */
uint32_t exmc_norsram_sdram_remap_get(void);
/* configure consecutive clock mode (only supported in EXMC BANK0 REGION0) */
void exmc_norsram_consecutive_clock_config(uint32_t clock_mode);
/* configure CRAM page size */
void exmc_norsram_page_size_config(uint32_t exmc_norsram_region, uint32_t page_size);
/* NAND */
/* enable or disable the EXMC NAND ECC function */
void exmc_nand_ecc_config(ControlStatus newvalue);
/* get NAND ECC value */
uint32_t exmc_ecc_get(void);
/* SDRAM */
/* enable read sample function */
void exmc_sdram_readsample_enable(void);
/* disable read sample function */
void exmc_sdram_readsample_disable(void);
/* configure the delayed sample clock of read data */
void exmc_sdram_readsample_config(uint32_t delay_cell, uint32_t extra_clk);
/* configure the SDRAM memory command */
void exmc_sdram_command_config(exmc_sdram_command_parameter_struct *exmc_sdram_command_init_struct);
/* set auto-refresh interval */
void exmc_sdram_refresh_count_set(uint32_t exmc_count);
/* set the number of successive auto-refresh command */
void exmc_sdram_autorefresh_number_set(uint32_t exmc_number);
/* configure the write protection function */
void exmc_sdram_write_protection_config(uint32_t exmc_sdram_device, ControlStatus newvalue);
/* get the status of SDRAM device0 or device1 */
uint32_t exmc_sdram_bankstatus_get(uint32_t exmc_sdram_device);

/* interrupt & flag functions */
/* get EXMC flag status */
FlagStatus exmc_flag_get(uint32_t exmc_bank, uint32_t flag);
/* clear EXMC flag status */
void exmc_flag_clear(uint32_t exmc_bank, uint32_t flag);
/* enable EXMC interrupt */
void exmc_interrupt_enable(uint32_t exmc_bank, uint32_t interrupt);
/* disable EXMC interrupt */
void exmc_interrupt_disable(uint32_t exmc_bank, uint32_t interrupt);
/* get EXMC interrupt flag */
FlagStatus exmc_interrupt_flag_get(uint32_t exmc_bank, uint32_t interrupt);
/* clear EXMC interrupt flag */
void exmc_interrupt_flag_clear(uint32_t exmc_bank, uint32_t interrupt);

#endif /* GD32H75E_EXMC_H */
